
**Terraform apply** (preview) ran in [5 seconds](https://github.com/evanyeung-clear/terraform-ci/actions/runs/16633051544).
```
terraform apply -no-color -input=false -auto-approve -var-file=terraform.tfvars.json
```

#### Diff of changes
```diff
+ okta_user.test1 will be created

```

<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.
Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # okta_user.test1 will be created
  + resource "okta_user" "test1" {
      + custom_profile_attributes = (known after apply)
      + email                     = "example@example.com"
      + expire_password_on_create = false
      + first_name                = "John"
      + id                        = (known after apply)
      + last_name                 = "Smith"
      + login                     = "example@example.com"
      + raw_status                = (known after apply)
      + skip_roles                = false
      + status                    = "ACTIVE"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```
</details>
